---
kind: property
id: P:Autodesk.Revit.DB.RenderingSettings.BackgroundStyle
source: html/66e5e11c-ed78-4b64-d458-77b525ba796f.htm
---
# Autodesk.Revit.DB.RenderingSettings.BackgroundStyle Property

The enum value that controls the background style for rendering.

## Syntax (C#)
```csharp
public BackgroundStyle BackgroundStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration